{
    "After you updated the course table, please contact your agent for your course analysis.": "After you update the course table, please contact your agent for your course analysis.",
    "Analyse": "Analyse",
    "Analyse V2": "Analyse V2",
    "Analysing": "Analysing",
    "Course Analysis banner": "The course analysis is for reference only. Carefully review any missing courses in each category and check whether your university offers them in upcoming semesters. Once identified, discuss with your agent.",
    "Course Analysis description": "On the General page, courses are roughly categorized by your major. The other tabs analyze curriculum matches for benchmark programs. Each school has different requirements per major category, and each category has a Required_ECTS value (credits you need to complete). You must exceed Required_ECTS for each category to meet degree requirements. If credits are lacking in any category, see the rightmost column of each program tab for suggested courses.",
    "Courses Analysis": "Courses Analysis",
    "Courses analysed successfully!": "Courses analysed successfully!",
    "Last analysis at": "Last analysis at",
    "No analysis yet": "No analysis yet",
    "Please be sure to update your Chinese and English names, as well as your date of birth information. This will affect the preparation of formal documents by the editor for you.": "Please ensure your Chinese and English names and date of birth are up to date. This affects how your editor prepares formal documents.",
    "Please complete My Courses table. The agent will provide you with course analysis and courses suggestion.": "Please complete the My Courses table. Your agent will provide course analysis and suggestions.",
    "Please go to each school's website to create an account and provide your login credentials. This will facilitate the agent in conducting pre-submission checks for you in the future.": "Please visit each school’s website to create an account and provide your login credentials so your agent can perform pre-submission checks.",
    "Please go to the Uni-Assist section, follow the instructions to complete": "Please go to the uni-assist section and follow the instructions to register an account, upload documents, and apply for the VPD (Vorprüfungsdokumentation).",
    "Please refer to the programs provided by the agent and visit the school's program website for detailed information. Complete the school selection before the start of the application season.": "Refer to programs suggested by your agent and visit the schools’ program pages for details. Complete your school selection before the application season starts.",
    "Please upload documents as soon as possible. The agent needs them to understand your academic background.": "Please upload your documents as soon as possible so your agent can understand your academic background.",
    "Select Category": "Select Category",
    "Select Target Group": "Select Target Group",
    "Select language": "Select language",
    "Student should access the analysed page in their course page.": "Students should open the ‘Analysed’ tab on their course page.",
    "Suggested Courses": "Suggested Courses",
    "The student will receive an email notification and the analysed course URL link.": "The student will receive an email notification with a link to the analysed courses page.",
    "Update transcript successfully! Your agent will be notified and will analyse your courses as soon as possible.": "Transcript updated successfully! Your agent will be notified and will analyze your courses as soon as possible.",
    "View Online": "View Online"
}